var constant = {};
constant.hannhashingyo = [
    [["ま", "か", "はん", "にゃ", "は", "ら", "み", "た", "しん", "ぎょう"], ["魔","訶","般","若","波","羅","蜜","多","心","経"]],
    [["かん", "じ", "ざい", "ぼ", "さつ"], ["観", "自", "在", "菩", "薩"]],
    [["ぎょう","じん","はん","にゃ","は","ら","み","った","じ"], ["行","深","般","若","波","羅","蜜","多","時"]],
    [["しょう", "けん", "ご", "うん", "かい", "くう"],["照","見","五","蘊","皆","空"]],
    [["ど","い","っさい","く","やく"], ["度","一","切","苦","厄"]],
    [["しゃ", "り", "し"],["舎","利","子"]],
    [["しき", "ふ","い","くう"],["色","不","異","空"]],
    [["くう","ふ","い","しき"],["空","不","異","色"]],
    [["しき","そく","ぜ","くう"],["色","即","是","空"]],
    [["くう","そく","ぜ","しき"],["空","即","是","色"]],
    [["じゅ","そう","ぎょう","しき","やく","ぶ","にょ","ぜ"],["受","想","行","識","亦","復","如","是"]],
    [["しゃ","り","し"],["舎","利","子"]],
    [["ぜ","しょ","ほう","くう","そう"],["是","諸","法","空","相"]],
    [["ふ","しょう","ふ","めつ"],["不","生","不","滅"]],
    [["ふ","く","ふ","じょう"],["不","垢","不","浄"]],
    [["ふ","ぞう","ふ","げん"],["不","増","不","減"]],
    [["ぜ","こ","くう","ちゅう","む","しき"],["是","故","空","中","無","色"]],
    [["む","じゅ","そう","ぎょう","しき"],["無","受","想","行","識"]],
    [["む","げん","に","び","ぜ","っしん","い"],["無","眼","耳","鼻","舌","身","意"]],
    [["む","しき","しょう","こう","み","そく","ほう"],["無","色","声","香","味","触","法"]],
    [["む","げん","かい","ない","し","む","い","しき","かい"],["無","眼","界","乃","至","無","意","識","界"]],
    [["む","む","みょう"],["無","無","明"]],
    [["やく","む","む","みょう","じん"],["亦","無","無","明","尽"]],
    [["ない","し","む","ろう","し"],["乃","至","無","老","死"]],
    [["やく","む","ろう","し","じん"],["亦","無","老","死","尽"]],
    [["む","く","しゅう","めつ","どう"],["無","苦","集","滅","道"]],
    [["む","ち","やく","む","とく"],["無","智","亦","無","得"]],
    [["い","む","しょ","とく","こ"],["以","無","所","得","故"]],
    [["ぼ","だい","さ","った"], ["菩","提","薩","垂"]],
    [["え","はん","にゃ","は","ら","み","った","こ"], ["依","般","若","波","羅","蜜","多","故"]],
    [["しん","む","けい","げ"],["心","無","罫","礙"]],
    [["む","けい","げ","こ"],["無","罫","礙","故"]],
    [["む","う","く","ふ"],["無","有","恐","怖"]],
    [["おん","り","い","っさい","てん","どう","む","そう"],["遠","離","一","切","顛","倒","夢","想"]],
    [["く","きょう","ね","はん"],["究","竟","涅","槃"]],
    [["さん","ぜ","しょ","ぶつ"],["三","世","諸","仏"]],
    [["え","はん","にゃ","は","ら","み","ったこ"],["依","般","若","波","羅","蜜","多","故"]],
    [["とく","あ","の","く","た","ら","さん","みゃく","さん","ぼ","だい"],["得","阿","耨","多","羅","三","藐","三","菩","提"]],
    [["こ","ち","はん","にゃ","は","ら","み","った"],["故","知","般","若","波","羅","蜜","多"]],
    [["ぜ","だい","じん","しゅ"],["是","大","神","呪"]],
    [["ぜ","だい","みょう","しゅ"],["是","大","明","呪"]],
    [["ぜ","む","じょう","しゅ"],["是","無","上","呪"]],
    [["ぜ","む","とう","どう","しゅ"],["是","無","等","等","呪"]],
    [["のう","じょ","い","っさい","く"],["能","除","一","切","苦"]],
    [["しん","じつ","ふ","こ"],["真","実","不","虚"]],
    [["こ","せつ","はん","にゃ","は","ら","み","った","しゅ"],["故","説","般","若","波","羅","蜜","多","呪"]],
    [["そく","せつ","しゅ","わつ"],["即","説","呪","曰"]],
    [["ぎゃ","てい","ぎゃ","てい"],["掲","諦","掲","諦"]],
    [["は","ら","ぎゃ","てい"],["波","羅","掲","諦"]],
    [["は","ら","そう","ぎゃ","てい"],["波","羅","僧","掲","諦"]],
    [["ぼ","じ","そ","わ","か"],["菩","提","薩","婆","訶"]],
    [["はん","にゃ","しん","ぎょう"],["般","若","心"," 経"]]];

var Jadata = new Array();
	Jadata["あ"] = ["a"];
	Jadata["い"] = ["i"];
	Jadata["う"] = ["u", "wu", "whu"];
	Jadata["え"] = ["e"];
	Jadata["お"] = ["o"];
	Jadata["か"] = ["ka", "ca"];
	Jadata["き"] = ["ki"];
	Jadata["く"] = ["ku", "qu", "cu"];
	Jadata["け"] = ["ke"];
	Jadata["こ"] = ["ko", "co"];
	Jadata["さ"] = ["sa"];
    Jadata["っさ"] = ["ssa"];
	Jadata["し"] = ["si", "shi", "ci"];
    Jadata["っし"] = ["ssi", "sshi", "cci"];
	Jadata["す"] = ["su"];
	Jadata["せ"] = ["se", "ce"];
	Jadata["そ"] = ["so"];
	Jadata["た"] = ["ta"];
    Jadata["った"] = ["tta"];
	Jadata["ち"] = ["ti", "chi"];
	Jadata["つ"] = ["tu", "tsu"];
	Jadata["て"] = ["te"];
	Jadata["と"] = ["to"];
	Jadata["な"] = ["na"];
	Jadata["に"] = ["ni"];
	Jadata["ぬ"] = ["nu"];
	Jadata["ね"] = ["ne"];
	Jadata["の"] = ["no"];
	Jadata["は"] = ["ha"];
	Jadata["ひ"] = ["hi"];
	Jadata["ふ"] = ["hu", "fu"];
	Jadata["へ"] = ["he"];
	Jadata["ほ"] = ["ho"];
	Jadata["ま"] = ["ma"];
	Jadata["み"] = ["mi"];
	Jadata["む"] = ["mu"];
	Jadata["め"] = ["me"];
	Jadata["も"] = ["mo"];
	Jadata["や"] = ["ya"];
	Jadata["ゆ"] = ["yu"];
	Jadata["よ"] = ["yo"];
	Jadata["ら"] = ["ra"];
	Jadata["り"] = ["ri"];
	Jadata["る"] = ["ru"];
	Jadata["れ"] = ["re"];
	Jadata["ろ"] = ["ro"];
	Jadata["わ"] = ["wa"];
	Jadata["を"] = ["wo"];
	Jadata["ん"] = ["nn"];
	Jadata["が"] = ["ga"];
	Jadata["ぎ"] = ["gi"];
	Jadata["ぐ"] = ["gu"];
	Jadata["げ"] = ["ge"];
	Jadata["ご"] = ["go"];
	Jadata["ざ"] = ["za"];
	Jadata["じ"] = ["zi", "ji"];
	Jadata["ず"] = ["zu"];
	Jadata["ぜ"] = ["ze"];
	Jadata["ぞ"] = ["zo"];
	Jadata["だ"] = ["da"];
	Jadata["ぢ"] = ["di"];
	Jadata["づ"] = ["du"];
	Jadata["で"] = ["de"];
	Jadata["ど"] = ["do"];
	Jadata["ば"] = ["ba"];
	Jadata["び"] = ["bi"];
	Jadata["ぶ"] = ["bu"];
	Jadata["べ"] = ["be"];
	Jadata["ぼ"] = ["bo"];
	Jadata["ぱ"] = ["pa"];
	Jadata["ぴ"] = ["pi"];
	Jadata["ぷ"] = ["pu"];
	Jadata["ぺ"] = ["pe"];
	Jadata["ぽ"] = ["po"];
	Jadata["ヴ"] = ["vu"];
	Jadata["っ"] = ["ltu", "xtu", "ltsu", "xtsu"];
	Jadata["ぁ"] = ["la", "xa"];
	Jadata["ぃ"] = ["li", "xi", "lyi", "xyi"];
	Jadata["ぅ"] = ["lu", "xu"];
	Jadata["ぇ"] = ["le", "xe", "lye", "xye"];
	Jadata["ぉ"] = ["lo", "xo"];
	Jadata["ゃ"] = ["lya", "xya"];
	Jadata["ゅ"] = ["lyu", "xyu"];
	Jadata["ょ"] = ["lyo", "xyo"];
	Jadata["ゎ"] = ["lwa", "xwa"];
	Jadata["ヵ"] = ["lka", "xka"];
	Jadata["ヶ"] = ["lke", "xke"];

	Jadata["きゃ"] = ["kya"];
	Jadata["きぃ"] = ["kyi"];
	Jadata["きゅ"] = ["kyu"];
	Jadata["きぇ"] = ["kye"];
	Jadata["きょ"] = ["kyo"];
	Jadata["しゃ"] = ["sya", "sha"];
	Jadata["しぃ"] = ["syi"];
	Jadata["しゅ"] = ["syu", "shu"];
	Jadata["しぇ"] = ["sye", "she"];
	Jadata["しょ"] = ["syo", "sho"];
	Jadata["ちゃ"] = ["tya", "cha", "cya"];
	Jadata["ちぃ"] = ["tyi", "cyi"];
	Jadata["ちゅ"] = ["tyu", "chu", "cyu"];
	Jadata["ちぇ"] = ["tye", "che", "cye"];
	Jadata["ちょ"] = ["tyo", "cho", "cyo"];
	Jadata["にゃ"] = ["nya"];
	Jadata["にぃ"] = ["nyi"];
	Jadata["にゅ"] = ["nyu"];
	Jadata["にぇ"] = ["nye"];
	Jadata["にょ"] = ["nyo"];
	Jadata["ひゃ"] = ["hya"];
	Jadata["ひぃ"] = ["hyi"];
	Jadata["ひゅ"] = ["hyu"];
	Jadata["ひぇ"] = ["hye"];
	Jadata["ひょ"] = ["hyo"];
	Jadata["みゃ"] = ["mya"];
	Jadata["みぃ"] = ["myi"];
	Jadata["みゅ"] = ["myu"];
	Jadata["みぇ"] = ["mye"];
	Jadata["みょ"] = ["myo"];
	Jadata["りゃ"] = ["rya"];
	Jadata["りぃ"] = ["ryi"];
	Jadata["りゅ"] = ["ryu"];
	Jadata["りぇ"] = ["rye"];
	Jadata["りょ"] = ["ryo"];
	Jadata["ぎゃ"] = ["gya"];
	Jadata["ぎぃ"] = ["gyi"];
	Jadata["ぎゅ"] = ["gyu"];
	Jadata["ぎぇ"] = ["gye"];
	Jadata["ぎょ"] = ["gyo"];
	Jadata["じゃ"] = ["zya", "ja", "jya"];
	Jadata["じぃ"] = ["zyi", "jyi"];
	Jadata["じゅ"] = ["zyu", "ju", "jyu"];
	Jadata["じぇ"] = ["zye", "je", "jye"];
	Jadata["じょ"] = ["zyo", "jo", "jyo"];
	Jadata["ぢゃ"] = ["dya"];
	Jadata["ぢぃ"] = ["dyi"];
	Jadata["ぢゅ"] = ["dyu"];
	Jadata["ぢぇ"] = ["dye"];
	Jadata["ぢょ"] = ["dyo"];
	Jadata["びゃ"] = ["bya"];
	Jadata["びぃ"] = ["byi"];
	Jadata["びゅ"] = ["byu"];
	Jadata["びぇ"] = ["bye"];
	Jadata["びょ"] = ["byo"];
	Jadata["ぴゃ"] = ["pya"];
	Jadata["ぴぃ"] = ["pyi"];
	Jadata["ぴゅ"] = ["pyu"];
	Jadata["ぴぇ"] = ["pye"];
	Jadata["ぴょ"] = ["pyo"];

	Jadata["いぇ"] = ["ye"];
	Jadata["うぁ"] = ["wha"];
	Jadata["うぃ"] = ["wi", "whi"];
	Jadata["うぇ"] = ["we", "whe"];
	Jadata["うぉ"] = ["who"];
	Jadata["くぁ"] = ["qa", "kwa"];
	Jadata["くぃ"] = ["qi", "kwi"];
	Jadata["くぇ"] = ["qe", "kwe"];
	Jadata["くぉ"] = ["qo", "kwo"];
	Jadata["つぁ"] = ["tsa"];
	Jadata["つぃ"] = ["tsi"];
	Jadata["つぇ"] = ["tse"];
	Jadata["つぉ"] = ["tso"];
	Jadata["てゃ"] = ["tha"];
	Jadata["てぃ"] = ["thi"];
	Jadata["てゅ"] = ["thu"];
	Jadata["てぇ"] = ["the"];
	Jadata["てょ"] = ["tho"];
	Jadata["とぁ"] = ["twa"];
	Jadata["とぃ"] = ["twi"];
	Jadata["とぅ"] = ["twu"];
	Jadata["とぇ"] = ["twe"];
	Jadata["とぉ"] = ["two"];
	Jadata["ふぁ"] = ["fa"];
	Jadata["ふゃ"] = ["fya"];
	Jadata["ふぃ"] = ["fi"];
	Jadata["ふゅ"] = ["fyu"];
	Jadata["ふぇ"] = ["fe"];
	Jadata["ふぉ"] = ["fo"];
	Jadata["ふょ"] = ["fyo"];
	Jadata["ぐぁ"] = ["gwa"];
	Jadata["でゃ"] = ["dha"];
	Jadata["でぃ"] = ["dhi"];
	Jadata["でゅ"] = ["dhu"];
	Jadata["でぇ"] = ["dhe"];
	Jadata["でょ"] = ["dho"];
	Jadata["どぁ"] = ["dwa"];
	Jadata["どぃ"] = ["dwi"];
	Jadata["どぅ"] = ["dwu"];
	Jadata["どぇ"] = ["dwe"];
	Jadata["どぉ"] = ["dwo"];
	Jadata["ヴぁ"] = ["va"];
	Jadata["ヴゃ"] = ["vya"];
	Jadata["ヴぃ"] = ["vi", "vyi"];
	Jadata["ヴゅ"] = ["vyu"];
	Jadata["ヴぇ"] = ["ve", "vye"];
	Jadata["ヴぉ"] = ["vo"];
	Jadata["ヴょ"] = ["vyo"];

	Jadata["a"] = ["a"];
	Jadata["b"] = ["b"];
	Jadata["c"] = ["c"];
	Jadata["d"] = ["d"];
	Jadata["e"] = ["e"];
	Jadata["f"] = ["f"];
	Jadata["g"] = ["g"];
	Jadata["h"] = ["h"];
	Jadata["i"] = ["i"];
	Jadata["j"] = ["j"];
	Jadata["k"] = ["k"];
	Jadata["l"] = ["l"];
	Jadata["m"] = ["m"];
	Jadata["n"] = ["n"];
	Jadata["o"] = ["o"];
	Jadata["p"] = ["p"];
	Jadata["q"] = ["q"];
	Jadata["r"] = ["r"];
	Jadata["s"] = ["s"];
	Jadata["t"] = ["t"];
	Jadata["u"] = ["u"];
	Jadata["v"] = ["v"];
	Jadata["w"] = ["w"];
	Jadata["x"] = ["x"];
	Jadata["y"] = ["y"];
	Jadata["z"] = ["z"];

	Jadata["A"] = ["A"];
	Jadata["B"] = ["B"];
	Jadata["C"] = ["C"];
	Jadata["D"] = ["D"];
	Jadata["E"] = ["E"];
	Jadata["F"] = ["F"];
	Jadata["G"] = ["G"];
	Jadata["H"] = ["H"];
	Jadata["I"] = ["I"];
	Jadata["J"] = ["J"];
	Jadata["K"] = ["K"];
	Jadata["L"] = ["L"];
	Jadata["M"] = ["M"];
	Jadata["N"] = ["N"];
	Jadata["O"] = ["O"];
	Jadata["P"] = ["P"];
	Jadata["Q"] = ["Q"];
	Jadata["R"] = ["R"];
	Jadata["S"] = ["S"];
	Jadata["T"] = ["T"];
	Jadata["U"] = ["U"];
	Jadata["V"] = ["V"];
	Jadata["W"] = ["W"];
	Jadata["X"] = ["X"];
	Jadata["Y"] = ["Y"];
	Jadata["Z"] = ["Z"];

	Jadata["0"] = ["0"];
	Jadata["1"] = ["1"];
	Jadata["2"] = ["2"];
	Jadata["3"] = ["3"];
	Jadata["4"] = ["4"];
	Jadata["5"] = ["5"];
	Jadata["6"] = ["6"];
	Jadata["7"] = ["7"];
	Jadata["8"] = ["8"];
	Jadata["9"] = ["9"];

	Jadata["-"] = ["-"];
	Jadata["ー"] = ["-"];
	Jadata[" "] = [" "];
	Jadata["　"] = [" "];
	Jadata["!"] = ["!"];
	Jadata["！"] = ["!"];
	Jadata["?"] = ["?"];
	Jadata["？"] = ["?"];
	Jadata[","] = [","];
	Jadata["、"] = [","];
	Jadata["."] = ["."];
	Jadata["。"] = ["."];